.cf.xml/Catalogs/обм_ИсходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>обм_ИсходящиеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелОтправительИсточника</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагОшибкиПриСоздании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

.cf.xml/Catalogs/обм_ИсходящиеСообщения/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Дозаполняет необходимые для работы алгоритмов обмена реквизиты
// Не перезаписывает, только дозаполняет пустые
//
// Параметры:
//  пИсточник			 - ЛюбаяСсылка, Строка -
//  пТекстСообщения		 - Строка -
//  пУзлыПолучатели		 - Строка - имена узлов-получателей, разделенные запятыми
//  пОбработчикОтправки	 - СправочникСсылка.общ_Обработчики -
//
Процедура Конструктор(пИсточник = Неопределено, пТекстСообщения = Неопределено, пУзлыПолучатели = Неопределено, пОбработчикОтправки = Неопределено) Экспорт
	
	исходящее = ЭтотОбъект;
	
	общ.ЕслиПустое(исходящее.Источник, пИсточник);
	общ.ЕслиПустое(исходящее.ТекстСообщения, пТекстСообщения);
	
	Если Получатели.Количество() = 0 Тогда
		узлы = СтрРазделить(пУзлыПолучатели, ",", Ложь);
		Для Каждого узел Из узлы Цикл
			исходящее.Получатели.Добавить().Узел = обм.УзелПривести(узел);
			
		КонецЦикла;
		узел = Неопределено;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(исходящее.ОбработчикОтправки) Тогда
		обработчик = Справочники.общ_Обработчики.НайтиСсылку(пОбработчикОтправки);
		исходящее.ОбработчикОтправки = обработчик;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		ДатаВремя = общ.ДатаУниверсальная();
		
	КонецЕсли;
	
	Получатели.Свернуть("Узел");
	Получатели.Сортировать("Узел");
	индекс = Получатели.Количество();
	Пока индекс > 0 Цикл
		индекс = индекс - 1;
		обм.УзелПривести(Получатели[индекс].Узел);
		Если ПустаяСтрока(Получатели[индекс].Узел) Тогда
			Получатели.Удалить(индекс);
			
		КонецЕсли;
		
	КонецЦикла;
	индекс = Неопределено;
	
	всеПолучатели = Получатели.ВыгрузитьКолонку("Узел");
	ПолучателиСтрокой = СтрСоединить(всеПолучатели, ",");
	
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = Строка(Источник) + " >>>> " + ПолучателиСтрокой;
		
	КонецЕсли;
	
	обм.УзелПривести(УзелОтправительИсточника);
	
КонецПроцедуры

#КонецОбласти // Обработчики событий

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
